app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.skill_id = @skill.id

    if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "user_id", "skill_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 4], ["comment", "you suck"], ["user_id", 1], ["skill_id", 3], ["created_at", "2015-09-08 21:09:32.301479"], ["updated_at", "2015-09-08 21:09:32.301479"]]

    def set_skill
      @skill = Skill.find(params[:skill_id])
---
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT 1  [["id", 3]]