app/controllers/skills_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."skill_id" = ?  ORDER BY created_at DESC  [["skill_id", 4]]
---
  def show
    @reviews = Review.where(skill_id: @skill.id).order("created_at DESC")

INSERT INTO "skills" ("title", "description", "experience", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "web developer"], ["description", "ruby on rails"], ["experience", "na"], ["user_id", 1], ["created_at", "2015-09-08 17:32:04.949540"], ["updated_at", "2015-09-08 17:32:04.949540"]]
---
  def create
    @skill = current_user.skills.build(skill_params)

    respond_to do |format|
      if @skill.save

UPDATE "skills" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "skills"."id" = ?
---
  def update
    respond_to do |format|
      if @skill.update(skill_params)

DELETE FROM "skills" WHERE "skills"."id" = ?  [["id", 2]]
---
  def destroy
    @skill.destroy